app/Controllers/Products.php

    public function index()
    {
        $model = new ProductModel();
        $data = $model->findAll();
---
SELECT *
FROM `product`

    public function show($id = null)
    {
        $model = new ProductModel();
        $data = $model->getWhere(['id' => $id])->getResult();
---
SELECT *
FROM `product`
WHERE `id` = '2'

    public function delete($id = null)
    {
        $model = new ProductModel();
        $data = $model->find($id);
        if ($data) {
            $model->delete($id);
---
SELECT *
FROM `product`
WHERE `product`.`id` = '2'
DELETE FROM `product`
WHERE `id` IN ('2')