app/Controllers/Register.php

    public function index()
    {
        $rules = [
            'email' => ['rules' => 'required|min_length[4]|max_length[255]|valid_email|is_unique[users.email]'],
            'password' => ['rules' => 'required|min_length[8]|max_length[255]'],
            'confirm_password'  => ['label' => 'confirm password', 'rules' => 'matches[password]']
        ];


        if ($this->validate($rules)) {
            $model = new UserModel();
            $data = [
                'email'    => $this->request->getVar('email'),
                'password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT)
            ];
            $model->save($data);
---
INSERT INTO `users` (`email`, `password`, `created_at`, `updated_at`) VALUES ('rd@gmail.com', '$2y$10$Z4aONZvGOcgJPeVJCsAdO.fgucVOJ31cjL2ZaAonU2cTgeBkao5ni', '2022-11-07 17:08:55', '2022-11-07 17:08:55')